Repository: KoBeWi/Metroidvania-System
Catalog: addons/MetroidvaniaSystem/Translations/*.po
Languages: de_de, es, fr, ja, pl, ru, sv_se

source: Current Layer
de_de: Aktuelle Ebene
es: Capa Actual
fr: Couche actuelle
ja: 現在のレイヤー
pl: Aktualna warstwa
ru: Текущий слой
sv_se: Nuvarande lager

source: Preview Layer
de_de: Vorschauebene
es: Previsualización de Capa
fr: Aperçu de la couche
ja: プレビューレイヤー
pl: Warstwa podglądu
ru: Предпросмотр слоя
sv_se: Förhandsgranska lager

source: Recenter View
de_de: Ansicht neu zentrieren
es: Centrar Vista
fr: Recentrer la vue
ja: 表示を中央にする
pl: Wycentruj widok
ru: Центрировать вид
sv_se: Centrera vyn igen

source: Mode
de_de: Modus
es: Modo
ja: モード
pl: Tryb
ru: Режим
sv_se: Läge

source: Room Layout
de_de: Raumplanung
es: Distribución sala
fr: Disposition de la pièce
ja: 部屋のレイアウト
pl: Układ pokoi
ru: Расположение комнат
sv_se: Rumslayout

source: Cell Color
de_de: Zellenfarbe
es: Color de Celda
fr: Couleur de la cellule
ja: セルの色
pl: Kolor komórki
ru: Цвет ячейки
sv_se: Cellfärg

source: Cell Symbol
de_de: Zellensymbol
es: Símbolo de Celda
fr: Symbole de la cellule
ja: セルのシンボル
pl: Symbol komórki
ru: Символ ячейки

source: Cell Group
de_de: Zellengruppe
es: Grupo de Celda
fr: Groupe de la cellule
ja: セルのグループ
pl: Grupa komórki
ru: Группа ячеек
sv_se: Cellgrupp

source: Border Type
de_de: Kantentyp
es: Tipo de Borde
fr: Type de bordure
ja: ボーダーの種類
pl: Typ brzegu
ru: Тип рамки
sv_se: Gränstyp

source: Border Color
de_de: Kantenfarbe
es: Color de Borde
fr: Couleur de la bordure
ja: ボーダーの色
pl: Kolor brzegu
ru: Цвет рамки
sv_se: Gränsfärg

source: Scene Assign
de_de: Szene zuweisen
es: Asignar Escena
fr: Attribuer une scène
ja: シーンのわりあて
pl: Przypisz scenę
ru: Назначение сцены
sv_se: Tilldelning av scen

source: Create New Scene
de_de: Erstelle neue Szene
es: Crear Nueva Escena
fr: Créer une nouvelle scène
ja: 新しいシーンを作成する
pl: Utwórz nową scenę
ru: Создать новую сцену
sv_se: Skapa ny scen

source: Scene Name
de_de: Szenenname
es: Nombre de Escena
fr: Nom de la scène
ja: シーンの名前
pl: Nazwa sceny
ru: Имя сцены
sv_se: Scennamn

source: Root Name
de_de: Wurzelname
es: Nombre Raiz
fr: Nom de la racine
ja: ルートの名前
pl: Nazwa korzenia
ru: Имя корня
sv_se: Rotnamn

source: Custom Elements
de_de: Benutzerdefinierte Elemente
es: Elementos Personalizados
fr: Éléments personnalisés
ja: カスタム要素
pl: Własne Elementy
ru: Кастомные элементы
sv_se: Anpassade element

source: Group ID
de_de: Gruppen ID
es: ID de Grupo
fr: ID du groupe
ja: グループID
pl: ID grupy
ru: ID группы
sv_se: Grupp-ID

source: Click a room or drag and drop a file
de_de: Klicke einen Raum oder ziehe eine Datei in einen Raum
es: Haz clic en una sala o arrastra un archivo
fr: Cliquez sur une pièce ou glissez-déposez un fichier
ja: 部屋をクリックするか、ファイルをドラッグアンドドロップします
pl: Kliknij pokój lub przeciągnij plik
ru: Кликните на комнату или перетащите файл
sv_se: Klicka på ett rum eller dra och släpp en fil

source: Data
de_de: Daten
es: Datos
fr: Données
ja: データ
pl: Dane
ru: Данные

source: No Custom Elements Registered
de_de: Keine benutzerdefinierten Elemente registriert
es: No hay elementos personalizados registrados
fr: Aucun élément personnalisé enregistré
ja: カスタム要素が登録されていません
pl: Brak zarejestrowanych Własnych Elementów
ru: Нет кастомных элементов
sv_se: Inga anpassade element registrerade

source: Ctrl+Click: Pick from map
de_de: Strg+Klick: Von der Karte auswählen
es: Ctrl + clic: seleccionar desde el mapa
fr: Ctrl + Clic : Sélectionner sur la carte
ja: Ctrl+クリック: マップからスポイト取得
pl: Ctrl+Klik: Pobierz z mapy
ru: Ctrl+клик: выбрать на карте
sv_se: Ctrl+klick: Välj från kartan

source: Shift+Drag: Move rooms
de_de: Shift+Ziehen: Raum bewegen
es: Shift + arrastrar: mover salas
fr: Shift + Glisser : Déplacer les pièces
ja: Shift+ドラッグ: 部屋をつかんで移動
pl: Shift+Przeciągnij: Przesuń pokoje
ru: Shift+перетащить: передвинуть комнаты
sv_se: Shift+Dra: Flytta rum

source: Shift+Click: Set for the whole room
de_de: Shift+Klick: Für den gesamten Raum anwenden
es: Shift + clic: aplicar a toda la sala
fr: Maj + Clic : Définir pour toute la pièce
ja: Shift+クリック: 部屋全体へ設定
pl: Shift+Klik: Ustaw dla całego pokoju
ru: Shift+клик: установить для всей комнаты
sv_se: Shift+klick: Ställ in för hela rummet

source: Scene name can't be empty.
de_de: Szenenname darf nicht leer sein.
es: El nombre de la escena no puede estar vacío.
fr: Le nom de la scène ne peut pas être vide.
pl: Nazwa sceny nie może być pusta.

source: Scene name contains invalid characters.
de_de: Szenenname beinhaltet ungültige Zeichen.
es: El nombre de la escena contiene caracteres invalidos.
fr: Le nom de la scène contient des caractères non valides.
pl: Nazwa sceny ma nieprawidłowe znaki.

source: Root node invalid.
de_de: Wurzelknoten ungültig.
es: Nodo Raíz Invalido.
fr: Nœud racine invalide.
pl: Nieprawidłowy korzeń sceny.

source: File already exists.
de_de: Datei existiert bereits.
es: Archivo ya existe.
fr: Le fichier existe déjà.
pl: Plik już istnieje.

source: None
de_de: Kein
es: Nada
fr: Aucun
ja: なし
pl: Brak
ru: Нет
sv_se: Ingen

source: Unnamed
de_de: Unbenannt
es: Sin nombre
fr: Sans nom
ja: 名称未設定
pl: Nienazwana
ru: Без имени
sv_se: Namnlös

source: Double-click to edit name.
de_de: Zum Namen Ändern doppelklicken.
es: Haz doble clic para editar el nombre.
fr: Double-cliquez pour modifier le nom.
ja: ダブルクリックで名前の変更
pl: Kliknij podwójnie, by edytować nazwę.
ru: Двойной клик для редактирования имени.
sv_se: Dubbelklicka för att redigera namn.

source: Discards local map data and loads the external one instead. If you made any local changes to the map, they will be lost.
de_de: Verwirft lokale Katendaten und lädt stattdessen die externen Daten. Falls lokale Änderungen an der Karte vorgenommen wurden, gehen diese verloren.
es: Descarta los datos locales del mapa y carga el externo en su lugar. Si realizaste cambios locales en el mapa, se perderán.
fr: Remplace les données locales de la carte par celles du fichier externe à la place. Si vous avez apporté des modifications locales à la carte, celles-ci seront perdues.
ja: 現在のマップデータの変更を破棄し、代わりに外部で更新されたマップデータでロードします。 現在のマップに変更を加えていた場合、その変更は失われます。
pl: Odrzuca lokalne dane mapy i wczytuje zamiast tego zewnętrzne. Jeśli masz jakiekolwiek lokalne zmiany w mapie, zostaną utracone.
ru: Сбрасывает локальные данные карты и загружает внешние данные. Если Вы сделали локальные изменения, они будут потеряны.
sv_se: Slänger lokal kartdata och laddar den externa istället. Om du har gjort några lokala ändringar på kartan kommer de att gå förlorade.

source: Saves local map data to the file, overwriting whatever is stored on disk. If you are using version control (e.g. git), this allows you to manually merge changes.
de_de: Speichert lokale Kartendaten in die Datei, wodurch die auf dem Speichermedium vorhandenen Daten überschrieben werden. Falls ein Versionierungstool (z.B. Git) verwendet wird, können somit Änderungen manuell zusammengeführt werden.
es: Guarda los datos locales del mapa en el archivo, sobrescribiendo lo que esté almacenado en el disco. Si estás utilizando control de versiones (e.g, Git), esto te permite fusionar los cambios manualmente.
fr: Enregistre les données locales de la carte dans un fichier, en écrasant les données stockées sur le disque. Si vous utilisez un contrôle de version (par exemple git), cela vous permet de fusionner manuellement les modifications.
ja: 現在のマップデータをファイルに上書き保存します。バージョン管理 (Git など) を使用している場合は、変更を手動でマージできます。
pl: Zapisuje lokalne dane mapy do pliku, nadpisując dane przechowane na dysku. Jeśli używasz kontroli wersji (np. git), pozwala to ręcznie łączyć zmiany.
ru: Сохраняет локальные данные карты в файл, перезаписывая то, что хранится на диске. Если Вы используете систему контроля версий (пр. git), это позволит Вам вручную вмержить изменения.
sv_se: Sparar lokal kartdata till filen och skriver över allt som finns lagrat på disken. Om du använder versionskontroll (t.ex. git) låter detta dig merga ändringar manuellt.

source: Save local map data into a backup file called "MapData(Copy).txt", then reloads map data. You can use the backup file to manually merge changes.
de_de: Speichert lokale Kartendaten in eine Sicherungsdatei namens "MapData(Copy).txt", und lädt dann die Kartendaten erneut. Die Sicherungsdatei kann verwendet werden, um Änderungen manuell zusammenzuführen.
es: Guarda los datos locales del mapa en un archivo de respaldo llamado "MapData(Copy).txt", luego recarga los datos del mapa. Puedes usar el archivo de respaldo para fusionar los cambios manualmente.
fr: Enregistre les données locales de la carte dans un fichier de sauvegarde nommé « MapData(Copy).txt », puis recharge les données cartographiques. Vous pouvez utiliser le fichier de sauvegarde pour fusionner manuellement les modifications.
ja: 現在のマップデータを「MapData(Copy).txt」というバックアップファイルに保存し、マップ データを再読み込みします。バックアップファイルを使用して、変更を手動でマージすることもできます。
pl: Zapisuje lokalne dane mapy do pliku zapasowego nazwanego "MapData(Copy).txt", po czym przeładowuje dane mapy. Możesz użyć pliku zapasowego do ręcznego połączenia zmian.
ru: Сохраняет локальные данные карты в бэкап файл "MapData(Copy).txt", затем перезагружает данные карты. Вы можете использовать бэкап файл, чтобы вручную вмержить изменения.
sv_se: Spara lokal kartdata i en säkerhetskopia som heter "MapData(Copy).txt" och laddar sedan om kartdata. Du kan använda säkerhetskopian för att manuellt slå samman ändringar.

source: Save Copy and Reload
de_de: Kopie speichern und neu laden
es: Guardar Copiar y Recargar
fr: Enregistrer une copie et recharger
pl: Zapisz kopię i przeładuj

source: Metroidvania System Database v.%s
de_de: Metroidvania System Datenbank v.%s
es: Base de datos del sistema Metroidvania v.%s
fr: Base de données Metroidvania Système v.%s
ja: Metroidvania System データベース v.%s
pl: Baza danych Metroidvania System v.%s
ru: База данных Metroidvania System v.%s
sv_se: Metroidvania systemdatabas v.%s

source: Map Editor
de_de: Karteneditor
es: Editor de Mapa
fr: Éditeur de carte
ja: マップエディタ
pl: Edytor mapy
ru: Редактор карты
sv_se: Kartredigerare

source: Map Viewer
de_de: Kartenansicht
es: Visor de Mapas
fr: Aperçu de la carte
ja: マップビューアー
pl: Podgląd mapy
ru: Просмотр карты
sv_se: Kartvisare

source: Manage
de_de: Verwalten
es: Gestionar
fr: Gérer
ja: 設定
pl: Zarządzaj
ru: Управление
sv_se: Hantera

source: Reload From Disk
de_de: Von Festplatte neu laden
es: Recargar desde el Disco
fr: Recharger depuis le disque
ja: ディスクから再読込
pl: Przeładuj z dysku
ru: Перегрузить с диска
sv_se: Ladda om från disk

source: Map data file was modified externally. What action should be taken? (hover a button for more info)
de_de: Die Kartendatendatei wurden von externer Quelle verändert. Welche Aktion soll vorgenommen werden? (Bewegen Sie den Mauszeiger über einen Knopf für weitere Informationen.)
es: El archivo de datos del mapa fue modificado externamente. ¿Qué acción se debe tomar? (Pasa el cursor sobre un botón para más información)
fr: Le fichier de données de la carte a été modifié en dehors de Godot.. Quelle mesure faut-il prendre ? (survolez le bouton pour plus d'informations)
ja: マップデータ ファイルが外部で変更されました。 どうしますか？ (ボタンにカーソルを合わせると詳細が表示されます)
pl: Plik danych mapy został zmodyfikowany na zewnątrz. Jaka akcja powinna zostać podjęta? (najedź na przycisk po więcej informacji)
ru: Данные карты были изменены извне. Какое действие нужно предпринять? (наведите курсор на кнопку для подробной информации)
sv_se: Kartdatafilen har ändrats externt. Vilken åtgärd ska vidtas? (håll över en knapp för mer information)

source: Re-save Map Data
de_de: Kartendaten erneut speichern
es: Volver a guardar los datos del mapa
fr: Enregistrer à nouveau les données cartographiques
ja: マップデータを再保存する
pl: Zapisz ponownie dane mapy
ru: Пересохранить данные карты
sv_se: Spara kartdatan igen

source: General Settings
de_de: Allgemeine Einstellungen
es: Configuración general
fr: Paramètres généraux
ja: 基本設定
pl: Ustawienia ogólne
ru: Общие настройки
sv_se: Allmänna inställningar

source: Refresh Custom Elements
de_de: Benutzerdefinierte Elemente aktualisieren
es: Refrescar elementos personalizados
fr: Actualiser les éléments personnalisés
ja: カスタム要素をリフレッシュする
pl: Odśwież Własne Elementy
ru: Обновить кастомные элементы
sv_se: Uppdatera anpassade element

source: Reload and Cleanup Map Data
de_de: Kartendaten neu laden und bereinigen
es: Recargar y limpiar los datos del mapa
fr: Recharger et nettoyer les données cartographiques
ja: マップデータの再読み込みとクリーンアップする
pl: Przeładuj i oczyść dane mapy
ru: Перезагрузить и очистить данные карты
sv_se: Ladda om och rensa kartdata

source: Validate Map Data
de_de: Kartendaten validieren
es: Validar datos del mapa
fr: Valider les données cartographiques
ja: マップデータを検証する（バリデーション）
pl: Waliduj dane mapy
ru: Проверить данные карты
sv_se: Validera kartdata

source: Validate Map Theme
de_de: Kartenthema validieren
es: Validar tema del mapa
fr: Valider le thème de la carte
ja: マップテーマを検証する（バリデーション）
pl: Waliduj motyw mapy
ru: Проверить тему карты
sv_se: Validera karttema

source: Export Map Data as JSON
de_de: Kartendaten als JSON exportieren
es: Exportar datos del mapa como JSON
fr: Exporter les données de la carte au format JSON
ja: マップデータをJSONで出力する
pl: Wyeksportuj dane mapy jako JSON
ru: Экспортировать данные карты в JSON
sv_se: Exportera kartdata som JSON

source: Edit Database Theme
de_de: Datenbankthema bearbeiten
es: Editar tema de la base de datos
fr: Modifier le thème de la base de données
ja: データベースのテーマを編集する
pl: Edytuj motyw bazy danych
ru: Редактировать тему базы данных
sv_se: Ändra databastema

source: Reset Database Theme
de_de: Datenbankthema zurücksetzen
es: Restablecer tema de la base de datos
fr: Réinitialiser le thème de la base de données
ja: データベースのテーマをリセットする
pl: Resetuj motyw bazy danych
ru: Сбросить тему базы данных
sv_se: Återställ databastema

source: Validation Result
de_de: Validierungsergebnis
es: Resultado de validación
fr: Résultats de la validation
ja: 検証結果（バリデーション）
pl: Wyniki walidacji
ru: Результат проверки
sv_se: Valideringsresultat

source: Close
de_de: Schließen
es: Cerrado
fr: Fermer
ja: 閉じる
pl: Zamknij
ru: Закрыть
sv_se: Stäng

source: JSON File
de_de: JSON Datei
es: Archivo JSON
fr: Fichier JSON
ja: JSONファイル
pl: Plik JSON
ru: JSON файл
sv_se: JSON-fil

source: No assigned map at: %s
de_de: Keine zugewiesene Karte bei: %s
es: No hay un mapa asignado en: %s
fr: Aucune carte attribuée dans : %s
ja: マップがわりあてられていません。%s
pl: Brak przypisanej mapy w: %s
ru: Нет назначенной карты в: %s
sv_se: Ingen karta tilldelad vid: %s

source: Invalid symbol (%d) at: %s
de_de: Ungültiges Symbol (%d) bei: %s
es: Símbolo inválido (%d) en: %s
fr: Symbole incorrect (%d) dans : %s
ja: シンボル設定に誤りがあります。(%d) %s
pl: Nieprawidłowy symbol (%d) w: %s
ru: Недопустимый символ (%d) в: %s
sv_se: Ogiltig symbol (%d) vid: %s

source: Invalid border (%d) at: %s
de_de: Ungültige Kante (%d) bei: %s
es: Borde inválido (%d) en: %s
fr: Bord incorrect (%d) dans : %s
ja: ボーダー設定に誤りがあります。(%d) %s
pl: Nieprawidłowy brzeg (%d) w: %s
ru: Недопустимая рамка (%d) в: %s
sv_se: Ogiltig gräns (%d) at: %s

source: Passage to nowhere at: %s
de_de: Gang ins Nirgendwo bei: %s
es: Pasaje hacia la nada en: %s
fr: Passage vers nulle part à : %s
ja: 到達できない通路が存在します。 %s
pl: Przejście donikąd w: %s
ru: Переход в никуда в: %s
sv_se: Passage till ingenstans vid: %s

source: Potentially unused symbol: %d
de_de: Möglicherweise unbenutztes Symbol bei: %d
es: Símbolo potencialmente sin uso: %d
fr: Symbole potentiellement inutilisé : %d
ja: 未使用の可能性があるシンボルがあります。%d
pl: Potencjalnie nieużywany symbol: %d
ru: Потенциально неиспользованный символ: %d
sv_se: Potentiellt oanvänd symbol: %d

source: Map data is valid.
de_de: Kartendaten sind valide.
es: Los datos del mapa son válidos.
fr: Les données de la carte sont valides.
ja: マップデータは正しく設定されています。
pl: Dane mapy są prawidłowe.
ru: Данные карты корректны.
sv_se: Kartdatan är giltig.

source: Cell Shape: %s
de_de: Zellenform: %s
es: Forma de celda: %s
fr: Forme de la cellule : %s
ja: セルの形: %s
pl: Kształt komórek: %s
ru: Форма ячейки: %s
sv_se: Cellform: %s

source: Rectangle
de_de: Rechteck
es: Rectangulo
ja: 長方形
pl: Prostokąt
ru: Прямоугольник
sv_se: Rektangel

source: Square
de_de: Quadrat
es: Cuadrado
fr: Carré
ja: 正方形
pl: Kwadrat
ru: Квадрат
sv_se: Kvadrat

source: Base Cell Size: %s
de_de: Standard Zellengröße: %s
es: Tamaño base de celda: %s
fr: Taille de la cellule de base : %s
ja: 基本セルサイズ: %s
pl: Podstawowy rozmiar komórki: %s
ru: Базовый размер ячейки: %s
sv_se: Bascellstorlek: %s

source: Theme is missing center texture. Map can't be drawn.
de_de: Dem Thema fehlt eine Zentraltextur. Die Karte kann nicht gezeichnet werden.
es: Falta la textura central del tema. No se puede dibujar el mapa.
fr: Il manque la texture centrale au thème. La carte ne peut pas être dessinée.
ja: テーマの中央のテクスチャが存在しないため、マップを描画できません。
pl: Motyw nie zawiera tekstury środka. Mapa nie może być rysowana.
ru: В теме отсутствует текстура центра. Карта не может быть отрисована.
sv_se: Tema saknar mittenresurs. Kartan kan inte ritas.

source: Uses unified corners.
de_de: Verwendet vereinte Ecken.
es: Usa esquinas unificadas.
fr: Utilise des coins unifiés.
ja: 同一の角の設定を使用します。
pl: Używa zunifikowanych narożników.
ru: Использует унифицированные углы.
sv_se: Använder enade hörn.

source: Size mismatch between empty texture (%s) and center texture.
de_de: Größenunterschiede zwischen leerer Textur (%s) und Zentraltextur.
es: Incompatibilidad de tamaño entre la textura vacía (%s) y la textura central.
fr: Taille incompatible entre la texture vide (%s) et la texture du centre.
ja: 空のテクスチャ(%s)と中央のテクスチャのサイズが一致しません。
pl: Niedopasowany rozmiar pomiędzy teksturą pustki (%s) i teksturą środka.
ru: Несовпадение размера между пустой текстурой (%s) и текстурой центра.
sv_se: Storleken matchar inte mellan tom resurs och mittenresurs.

source: Number of horizontal and vertical borders do not match.
de_de: Anzahl von horizontalen und vertikalen Kanten stimmen nicht überein.
es: El número de bordes horizontales y verticales no coincide.
fr: Le nombre de bords horizontaux et verticaux n'est pas égal.
ja: 横と縦のボーダーの数が一致していません。
pl: Liczba poziomych i pionowych brzegów nie jest równa.
ru: Количество горизонтальных и вертикальных рамок не совпадает.
sv_se: Antal horisontella och vertikala gränser matchar inte.

source: Vertical wall texture
de_de: Vertikale Wandtextur
es: Textura de pared vertical
fr: Texture de mur vertical
ja: 縦の壁のテクスチャ
pl: Pionowa tekstura ściany
ru: Текстура вертикальной стены
sv_se: Vertikal väggresurs

source: Vertical passage texture
de_de: Vertikale Gangtextur
es: Textura de pasaje vertical
fr: Texture de passage vertical
ja: 縦の通路のテクスチャ
pl: Pionowa tekstura przejścia
ru: Текстура вертикального перехода
sv_se: Vertikal passageresurs

source: Vertical border texture at index %d
de_de: Vertikale Kantentextur bei Index %d
es: Textura de borde vertical en el índice %d
fr: Texture du bord vertical à l'index %d
ja: 縦のボーダーのテクスチャ %d番目 (index %d)
pl: Pionowa tekstura brzegu z indeksem %d
ru: Текстура вертикального перехода по индексу %d
sv_se: Vertikal gränsresurs vid index %d

source: Horizontal wall texture
de_de: Horizontale Wandtextur
es: Textura de pared horizontal
fr: Texture de mur horizontal
ja: 横の壁のテクスチャ
pl: Pozioma tekstura ściany
ru: Текстура горизонтальной стены
sv_se: Horisontell väggresurs

source: Horizontal passage texture
de_de: Horizontale Gangtextur
es: Textura de pasaje horizontal
fr: Texture de passage horizontal
ja: 横の通路のテクスチャ
pl: Pozioma tekstura przejścia
ru: Текстура горизонтального перехода
sv_se: Horisontell passageresurs

source: Horizontal border texture at index %d
de_de: Horizontale Kantentextur bei Index %d
es: Textura de borde horizontal en el índice %d
fr: Texture du bord horizontal à l'index %d
ja: 縦のボーダーのテクスチャ %d番目 (index %d)
pl: Pozioma tekstura brzegu z indeksem %d
ru: Текстура горизонтального перехода по индексу %d
sv_se: Horisontell gränsresurs vid index %d

source: Wall texture
de_de: Wandtextur
es: Textura de Pared
fr: Texture du mur
ja: 壁のテクスチャ
pl: Tekstura ściany
ru: Текстура стены
sv_se: Väggresurs

source: Passage texture
de_de: Gangtextur
es: Textura de pasaje
fr: Texture du passage
ja: 通路のテクスチャ
pl: Tekstura przejścia
ru: Текстура перехода
sv_se: Passageresurs

source: Border texture at index %d
de_de: Kantentextur bei Index %d
es: Textura de borde en el índice %d
fr: Texture de la bordure à l'index %d
ja: ボーダーのテクスチャ %d番目 (index %d)
pl: Tekstura brzegu z indeksem %d
ru: Текстура рамки по индексу %d
sv_se: Gränsresurs vid index %d

source: Uncollected item symbol index is greater than number of available symbols.
de_de: Nicht eingesammeltes Objekt Symbol Index ist größer als die Anzahl der verfügbaren Symbole.
es: El índice del símbolo de objeto no recolectado es mayor que el número de símbolos disponibles.
fr: L'index du symbole de l'objet non collecté est supérieur au nombre de symboles disponibles.
ja: 未収集のアイテムのシンボル数（シンボルのindex）が、使用可能なシンボル数を超えています。
pl: Indeks symbolu niezebranego przedmiotu jest większy od liczby dostępnych symboli.
ru: Индекс символа несобранного предмета больше, чем количество доступных символов.
sv_se: Ouppsamlat objektsymbolindex är större än antalet tillgängliga symboler.

source: Collected item symbol index is greater than number of available symbols.
de_de: Eingesammeltes Objekt Symbol Index ist größer als die Anzahl der verfügbaren Symbole.
es: El índice del símbolo de objeto recolectado es mayor que el número de símbolos disponibles.
fr: L'index du symbole de l'objet collecté est supérieur au nombre de symboles disponibles.
ja: 収集済みのアイテムのシンボル数（シンボルのindex）が、使用可能なシンボル数を超えています。
pl: Indeks symbolu zebranego przedmiotu jest większy od liczby dostępnych symboli.
ru: Индекс символа собранного предмета больше, чем количество доступных символов.
sv_se: Samlade objektsymbolindex är större än antalet tillgängliga symboler.

source: Symbol %d texture
de_de: Symbol %d Textur
es: Textura del símbolo %d
fr: Texture du symbole %d
ja: シンボルのテクスチャ %d
pl: Tekstura %s symbolu
ru: Текстура символа %d
sv_se: Symbol %d resurs

source: U corner texture
de_de: U Eckentextur
es: Textura de esquina en U
fr: Texture du coin en U
ja: U 型の通路角のテクスチャ
pl: Tekstura narożnika U
ru: Текстура угла U
sv_se: U hörnresurs

source: L corner texture
de_de: L Eckentextur
es: Textura de esquina en L
fr: Texture du coin en L
ja: L 型の通路角のテクスチャ
pl: Tekstura narożnika L
ru: Текстура угла L
sv_se: L hörnresurs

source: T corner texture
de_de: T Eckentextur
es: Textura de esquina en T
fr: Texture du coin en T
ja: T 型の通路角のテクスチャ
pl: Tekstura narożnika T
ru: Текстура угла T
sv_se: T hörnresurs

source: Cross corner texture
de_de: Kreuz Eckentextur
es: Textura de esquina en cruz
fr: Texture du coin en croix
ja: 十字路 の通路角のテクスチャ
pl: Tekstura narożnika krzyżowego
ru: Текстура крестового угла
sv_se: Korshörnresurs

source: Inner corner texture
de_de: Innere Eckentextur
es: Textura de esquina interna
fr: Texture du coin intérieur
ja: 通路角の内側のテクスチャ
pl: Tekstura narożnika wewnętrznego
ru: Текстура внутреннего угла
sv_se: Resurs för inre hörn

source: Outer corner texture
de_de: Äußere Eckentextur
es: Textura de esquina externa
fr: Texture du coin extérieur
ja: 通路角の外側のテクスチャ
pl: Tekstura narożnika zewnętrznego
ru: Текстура внешнего угла
sv_se: Resurs för yttre hörn

source: Player location scene is not a Node2D.
de_de: Spielerpositionsszene ist kein Node2D Knoten.
es: La escena de ubicación del jugador no es un Node2D.
fr: La scène du joueur n'est pas de type Node2D.
ja: プレイヤーの位置のシーンがNode2Dになっていません。
pl: Scena lokacji gracza nie jest typu Node2D.
ru: Сцена расположения игрока не является Node2D.
sv_se: Spelarens platsscene är inte en Node2D.
