Repository: KoBeWi/Metroidvania-System
Catalog: addons/MetroidvaniaSystem/Translations/*.po
Languages: de_de, es, fr, ja, pl, ru, sv_se

source: Missing player location scene. Player location can't be displayed using built-in methods.
de_de: Fehlende Spielerpositionsszene. Spielerposition kann nicht mithilfe von integrierten Methoden dargestellt werden.
es: Falta la escena de ubicación del jugador. La ubicación del jugador no puede mostrarse usando los métodos integrados.
fr: Absence de la scène du joueur. L'emplacement du joueur ne peut pas être affiché à l'aide des méthodes intégrées.
ja: プレイヤーの位置のシーンがありません。組み込み関数を使用してプレイヤーの位置を表示できません。
pl: Brak sceny lokacji gracza. Lokacja gracza nie może być wyświetlona używając wbudowanych metod.
ru: Отсутствует сцена расположения игрока. Расположение игрока не может быть отображено используя встроенные методы.
sv_se: Spelarens plats saknas. Spelarens plats kan inte visas med inbyggda metoder.

source: Theme is valid.
de_de: Thema ist gültig.
es: Tema Invalido.
fr: Le thème est valide.
ja: テーマは正しく設定されています。
pl: Motyw jest poprawny.
ru: Тема корректна.
sv_se: Temat är giltigt.

source: %s has invalid height (%d). It should be vertical, oriented towards the right side and match the height of the center texture.
de_de: %s hat eine ungültige Höhe (%d). Es sollte vertikal sein, auf die rechte Seite orientiert sein und mit der Größe der Zentraltextur übereinstimmen.
es: %s tiene una altura inválida (%d). Debe ser vertical, estar orientado hacia el lado derecho y coincidir con la altura de la textura central.
fr: %s a une hauteur incorrecte (%d). Elle doit être verticale, orientée vers la droite et correspondre à la hauteur de la texture centrale.
ja: %s の高さの設定に誤りがあります。 (%d).向きが縦かつ、右側を向いており、中央のテクスチャの高さと一致する必要があります。
pl: %s ma nieprawidłową wysokość (%d). Powinna być pionowa, ustawiona w kierunku prawej strony i pasować do wysokości tekstury środka.
ru: %s имеет некорректную высоту (%d). Она должно быть вертикальной, направленной в правую сторону и совпадающей по высоте с текстурой центра.
sv_se: %s har ogiltig höjd (%d). Den ska vara vertikal, orienterad mot höger sida och matcha höjden på mittresurs.

source: %s is wider than half of the center texture. It may cause overlaps.
de_de: %s ist breiter als die Hälfte der Breite der Zentraltextur. Es kann zu Überlappungen führen.
es: %s es más ancho que la mitad de la textura central. Esto puede causar superposiciones.
fr: %s est plus large que la moitié de la texture centrale. Cela peut entraîner une superposition d'images.
ja: %s は中央のテクスチャの半分より幅が広くなっています。他と重なる可能性があります。
pl: %s jest szersze niż połowa tekstury środka. Może powodować nachodzenie.
ru: %s шире, чем половина текстуры центра. Это может привести к наложениям.
sv_se: %s är bredare än hälften av mittresurs. Det kan orsaka överlappningar.

source: %s is empty.
de_de: %s ist leer.
es: %s Esta Vacío.
fr: %s est vide.
ja: %s が空になっています。
pl: %s jest puste.
ru: %s пуста.
sv_se: %s är tom.

source: %s has invalid height (%d). It should be vertical, oriented towards the right side and height should match the width of the center texture.
de_de: %s hat eine ungültige Höhe (%d). Es sollte vertikal sein, auf die rechte Seite orientiert sein und die Höhe sollte mit der Breite der Zentraltextur übereinstimmen.
es: %s tiene una altura inválida (%d). Debe ser vertical, estar orientado hacia el lado derecho y su altura debe coincidir con el ancho de la textura central.
fr: %s a une hauteur incorrecte (%d). Elle doit être verticale, orientée vers la droite et correspondre à la largeur de la texture centrale.
ja: %s の高さの設定に誤りがあります。 (%d).向きが縦かつ、右側を向いており、中央のテクスチャの幅と一致する必要があります。
pl: %s ma nieprawidłową wysokość (%d). Powinna być pionowa, ustawiona w kierunku prawej strony i pasować do szerokości tekstury środka.
ru: %s имеет некорректную высоту (%d). Она должно быть вертикальной, направленной в правую сторону и совпадающей по высоте с текстурой центра.
sv_se: %s har ogiltig höjd (%d). Den ska vara vertikal, orienterad mot höger sida och höjden ska matcha bredden på mittresurs.

source: %s is wider than half of the height of the center texture. It may cause overlaps.
de_de: %s ist breiter als die Hälfte der Höhe der Zentraltextur. Es kann zu Überlappungen führen.
es: %s es más ancho que la mitad de la altura de la textura central. Esto puede causar superposiciones.
fr: %s est plus large que la moitié de la hauteur de la texture centrale. Cela peut entraîner une superposition d'images.
ja: %s は中央のテクスチャの高さの半分より幅が広くなっています。他と重なる可能性があります。
pl: %s jest szersze niż połowa wysokości tekstury środka. Może powodować nachodzenie.
ru: %s шире, чем половина высоты текстуры центра. Это может привести к наложениям.
sv_se: %s är bredare än hälften av höjden på mittresursen. Det kan orsaka överlappningar.

source: %s is bigger than center texture. It will stick out of cells.
de_de: %s ist größer als die Zentraltextur. Es wird aus den Zellen hervorragen.
es: %s es más grande que la textura central. Se sobresaldrá de las celdas.
fr: %s est plus grand que la texture du centre. Il dépassera des cellules.
ja: %s は中央のテクスチャより大きくなっています。セルからはみ出します。
pl: %s jest większe niż tekstura środka. Będzie wystawać poza komórki.
ru: %s больше, чем текстура центра. Она будет выступать за края ячеек.
sv_se: %s är större än mittresursen. Det kommer att sticka ut ur cellerna.

source: %s is bigger than half of the center texture. It may cause overlaps.
de_de: %s ist größer als die Hälfte der Zentraltextur. Es kann zu Überlappungen führen.
es: %s es más grande que la mitad de la textura central. Esto puede causar superposiciones.
fr: %s est supérieur à la moitié de la hauteur de la texture centrale. Cela peut entraîner une superposition d'images.
ja: %s は中央のテクスチャより大きくなっています。他と重なる可能性があります。
pl: %s jest większe niż połowa wysokości tekstury środka. Może powodować nachodzenie.
ru: %s больше, чем половина текстуры центра. Это может привести к наложениям.
sv_se: %s är större än hälften av mittresursen. Det kan orsaka överlappningar.

source: Set Collectible Icon
fr: Définir l'icône du collectible
pl: Ustaw ikonę znajdźki

source: Rename Collectible
fr: Renommer le collectible
pl: Zmień nazwę znajdźki

source: Node Name
de_de: Knotenname
es: Nombre del Nodo
fr: Nom du nœud
ja: ノード名
pl: Nazwa węzła
ru: Имя узла
sv_se: Nodnamn

source: Icon
es: Icono
fr: Icône
ja: アイコン
pl: Ikona
ru: Иконка
sv_se: Ikon

source: Add Collectible
fr: Ajouter un collectible
pl: Dodaj znajdźkę

source: Remove Collectible
fr: Supprimer un collectible
pl: Usuń znajdźkę

source: Preview Mapped
de_de: Kartiertes Vorschauen
es: Vista previa mapeada
fr: Aperçu de la carte
ja: プレビューマップ
pl: Podejrzyj zmapowane
ru: Предпросмотр карты
sv_se: Förhandsgranska mappade

source: Collectible Settings
de_de: Sammelobject-Einstellungen
es: Configuración de coleccionables
fr: Paramètres des collectibles
ja: 収集可能設定
pl: Ustawienia znajdziek
ru: Настройки коллекционных предметов
sv_se: Samlarinställningar

source: Collectible Finder
de_de: Sammelobject-Suche
es: Buscador de coleccionables
fr: Recherche de collectible
ja: 収集アイテムの検索
pl: Szukanie znajdziek
ru: Поисковик коллекционных предметов
sv_se: Samlarhittare

source: Scan Maps
de_de: Karten überprüfen
es: Escanear mapas
fr: Scanner des cartes
ja: マップをスキャン
pl: Skanuj mapy
ru: Сканировать карты
sv_se: Skanna kartor

source: Display on Map
de_de: Auf der Karte anzeigen
es: Mostrar en el mapa
fr: Afficher sur la carte
ja: マップ上に表示する
pl: Pokaż na mapie
ru: Отображать на карте
sv_se: Visa på kartor

source: Refresh Adjacent Previews
fr: Actualiser les aperçus adjacents
pl: Odśwież sąsiednie podglądy

source: Pick Scene...
fr: Sélectionnez une scène...
pl: Wybierz scenę...

source: <Invalid>
fr: <Incorrect>
pl: <Nieprawidłowy>

source: Print Object ID
de_de: Objekt ID drucken
es: Imprimir ID del objeto
fr: Afficher l'ID de l'objet
pl: Wypisz ID obiektu

source: Copy Object ID to Clipboard
de_de: Objekt ID wurde in die Zwischenablage kopiert
es: Copiar ID del objeto al portapapeles
fr: Copier l'ID de l'objet dans le presse-papiers
pl: Skopiuj ID obiektu do schowka

source: MetSys map has been modified. Do you want to save?
de_de: MetSys wurde geändert. Möchten Sie speichern?
es: El mapa de MetSys ha sido modificado. ¿Deseas guardar los cambios?
fr: La carte MetSys a été modifiée. Voulez-vous enregistrer les modifications ?
ja: MetSys マップが変更されました。 保存しますか?
pl: Mapa MetSys została zmodyfikowana. Czy chcesz zapisać zmiany?
ru: MetSys карта была изменена. Хотите ли Вы сохранить изменения?
sv_se: MetSys-karta har modifierats. Vill du spara?

source: No scene open to check Node.
de_de: Es ist keine Szene zum Überprüfen des Knotens geöffnet.
es: No hay ninguna escena abierta para comprobar el nodo.
fr: Pas de scène ouverte pour vérifier le nœud.
pl: Brak otwartej sceny, by sprawdzić węzeł.

source: You need to select a single Node.
de_de: Es muss ein einzelner Knoten ausgewählt sein.
es: Necesitas seleccionar un único nodo.
fr: Vous devez sélectionner un seul nœud.
pl: Musisz wybrać jeden węzeł.

source: Could not determine ID.
de_de: Die ID konnte nicht festgestellt werden.
es: No se pudo determinar el ID.
fr: Impossible de déterminer l'ID.
pl: Nie udało się określić ID.

source: ID of the selected Node is "%s".
de_de: ID des ausgewählten Knotens ist "%s".
es: El ID del nodo seleccionado es “%s”.
fr: L'ID du nœud sélectionné est « %s ».
pl: ID wybranego węzła to "%s".

source: ID "%s" copied to clipboard.
de_de: ID "%s" wurde in die Zwischenablage kopiert.
fr: L'ID « %s » est copié dans le presse-papiers.
pl: ID "%s" skopiowane do schowka.

source: Error!
de_de: Fehler!
fr: Erreur !
pl: Błąd!

source: MetSys restart failed, the singleton still can't be loaded. Make sure the "MetroidvaniaSystem.gd" script has no errors. Common cause of errors are: - Using Godot version older than 4.4. - Name conflicts with one of the classes. The plugin will be now disabled. Fix the errors and try again.
de_de: MetSys Neustart fehlgeschlagen, das Singleton kann immer noch nicht geladen werden. Stellen Sie bitte sicher, dass das "MetroidvaniaSystem.gd" Skript keine Fehler enthält. Herkömmliche Fehlergründe sind: - Sie verwenden eine Godot Version älter als 4.4. - Der Name überschneidet sich mit dem einer Klasse. Das Plugin wird nun ausgeschalten. Bitte beheben Sie die Fehler und versuchen Sie es erneut.
es: Error al reiniciar MetSys, el singleton aún no puede cargarse. Asegúrate de que el script "MetroidvaniaSystem.gd" no tenga errores. Causas comunes de errores: -Usar una versión de Godot anterior a la 4.4. -Conflictos de nombres con alguna clase. El plugin será desactivado. Corrige los errores y vuelve a intentarlo.
fr: Le redémarrage de MetSys a échoué, le singleton ne peut pas être chargé. Assurez-vous que le script « MetroidvaniaSystem.gd » ne contient pas d'erreurs. Les causes courantes des erreurs sont les suivantes : - Utilisation d'une version de Godot antérieure à la version 4.4 - Conflit de nom avec l'une des classes. Le plugin va maintenant être désactivé. Corrigez les erreurs et réessayez.
ja: MetSys の再起動に失敗しました。シングルトンはまだロードできません。"MetroidvaniaSystem.gd" スクリプトにエラーがないことを確認してください。 エラーの一般的な原因は次のとおりです: - Godot バージョン 4.4 より古いバージョンを使用している。 - クラスのいずれかと名前が競合している。 プラグインは無効になります。エラーを修正して再試行してください。
pl: Restart MetSys się nie powiódł, singleton nie może zostać wczytany. Upewnij się, że skrypt "MetroidvaniaSystem.gd" nie ma błędów. Typowe powody błędów to: - Używanie wersji Godota starszej niż 4.4 - Konflikt nazwy z jedną z klas. Wtyczka zostanie teraz wyłączona. Napraw błędy i spróbuj ponownie.
ru: Рестарт MetSys не удался, синглтон всё ещё не может быть загружен. Убедитесь, что скрипт "MetroidvaniaSystem.gd" не содержит ошибок. Распространённые причины ошибок: - Использование более старой версии Godot, чем 4.4. - Конфликт имён с одним из существующих классов. Плагин будет отключен. Исправьте ошибки и попробуйте ещё раз.
sv_se: Omstarten av MetSys misslyckades, singletonen kan fortfarande inte laddas. Se till att skriptet "MetroidvaniaSystem.gd" inte har några fel. Vanliga orsaker till fel är: - Använder Godot-version äldre än 4.4. - Namnkonflikt med en av klasserna. Plugin-programmet kommer nu att inaktiveras. Åtgärda felen och försök igen.

source: Runs get_object_id() for the selected Node and prints the result.
de_de: Führt get_object_id() für den ausgewählten Knoten aus und gibt das Ergebnis aus.
es: Ejecuta get_object_id() para el nodo seleccionado y muestra el resultado.
fr: Exécute get_object_id() pour le nœud sélectionné et affiche le résultat.
pl: Uruchamia get_object_id() dla wybranego węzła i wypisuje rezultat.

source: Runs get_object_id() for the selected Node and copies the result to clipboard.
de_de: Führt get_object_id() für den ausgewählten Knoten aus und kopiert das Ergebnis in die Zwischenablage.
es: Ejecuta get_object_id() para el nodo seleccionado y copia el resultado al portapapeles.
fr: Exécute get_object_id() pour le nœud sélectionné et copie le résultat dans le presse-papiers.
pl: Uruchamia get_object_id() dla wybranego węzła i kopiuje rezultat do schowka.

source: Scene File
de_de: Szenendatei
es: Archivo de Escena
fr: Fichier de scène
ja: シーンファイル
pl: Plik sceny
ru: Файл сцены
sv_se: Scenfil

source: If enabled, the room will have scene's UID assigned instead of path.
de_de: Wenn ausgewählt, wird der Raum die UID der Szene besitzen anstelle des Szenenpfads.
es: Si está habilitado, se asignará el UID de la escena a la sala en lugar de la ruta.
ja: 有効にすると、部屋にはパスではなくシーンのUIDが割り当てられます。
ru: Когда включено, комната будет иметь UID сцены вместо пути.
sv_se: Om det är aktiverat kommer scenens UID att tilldelas istället för sökväg.

source: Assign UID
de_de: UID Zuweisen
es: Asignar UID
ja: UIDのわりあて
ru: Назначить UID
sv_se: Tilldela UID

source: Zoom
ja: ズーム
ru: Маштаб

source: Map
ja: マップ
ru: Карта
sv_se: Karta
